In [ ]:
#1. How many employees are there in each department?
import pandas as pd
data=pd.read_csv('employee_data_project.csv')

data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [15]:
no_of_employee=data['Department'].value_counts()
no_of_employee

Department
Sales        97
HR           90
R&D          86
IT           77
Marketing    75
Finance      75
Name: count, dtype: int64

In [16]:
#2. What is the average salary in each department?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [ ]:
average_salary = data.groupby('Department')['Salary'].mean()

print(average_salary)

Department
Finance      94582.053333
HR           89361.022222
IT           86479.662338
Marketing    81493.346667
R&D          87429.209302
Sales        89272.876289
Name: Salary, dtype: float64

In [29]:
#3. Which department has the highest number of employees with “Excellent” performance?
## (idxmax) It returns the index label (i.e., the department name) of the maximum value in the Series.

#data[data['Performance_Rating'] == 'Excellent']['Department'].value_counts().idxmax()

data[data['Performance_Rating'] == 'Excellent']['Department'].value_counts()

Department
Sales        21
HR           20
R&D          17
IT           17
Finance      16
Marketing    14
Name: count, dtype: int64

In [ ]:
#4. What is the distribution of positions across the organization?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [31]:
data['Position'].value_counts()

Position
Team Lead    108
Manager      105
Analyst      101
Intern        93
Executive     93
Name: count, dtype: int64

In [32]:
#5. What is the average attendance rate per department?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [35]:
average_attendence = data.groupby('Department')['Attendance_Rate'].mean()
average_attendence

Department
Finance      81.531600
HR           80.029889
IT           77.229091
Marketing    81.950800
R&D          78.958140
Sales        79.951546
Name: Attendance_Rate, dtype: float64

In [36]:
#6. Who are the top 10 highest paid employees?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [44]:
top_10=data.sort_values(by='Salary',ascending=False).head(10)
top_10[['Employee_ID','Name','Department','Salary']]

    Employee_ID          Name Department  Salary
144     EMP1144  Employee_144         IT  149797
252     EMP1252  Employee_252      Sales  149771
166     EMP1166  Employee_166        R&D  149719
258     EMP1258  Employee_258      Sales  149614
307     EMP1307  Employee_307    Finance  149235
339     EMP1339  Employee_339        R&D  149179
327     EMP1327  Employee_327        R&D  148865
40      EMP1040   Employee_40         HR  148721
174     EMP1174  Employee_174         IT  148195
159     EMP1159  Employee_159      Sales  147718

In [ ]:
#7. What is the average age of employees in each department?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [46]:
average_age=data.groupby('Department')['Age'].mean()
average_age

Department
Finance      40.986667
HR           42.700000
IT           39.402597
Marketing    41.186667
R&D          38.581395
Sales        39.824742
Name: Age, dtype: float64

In [ ]:
#8. Count employees who joined after 2022.
import datetime as dt
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [60]:
data['Joining_Date'] = pd.to_datetime(data['Joining_Date'])
count_after_2022 = data[data['Joining_Date'] > '2022-12-31'].value_counts().sum()
print("Total Numbe rof employee who joined after 2022: ",count_after_2022)

Total Numbe rof employee who joined after 2022:  132

In [61]:
#9. What’s the average number of leaves taken by each position?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [62]:
average_leaves=data.groupby('Position')['Leaves_Taken'].mean()
average_leaves

Position
Analyst      12.900990
Executive    15.043011
Intern       14.795699
Manager      15.552381
Team Lead    16.268519
Name: Leaves_Taken, dtype: float64

In [ ]:
#10. How many employees have taken more than 20 leaves?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [72]:
more_than_20_leaves=(data['Leaves_Taken']>20).sum()
print("Toatal Number of People: ",more_than_20_leaves)

Toatal Number of People:  161

In [73]:
#11. Find the employee(s) with the lowest attendance rate.
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [79]:
min_attendance = data['Attendance_Rate'].min()
lowest_attendance_employees = data[data['Attendance_Rate'] == min_attendance]
lowest_attendance_employees[['Employee_ID', 'Name', 'Department', 'Attendance_Rate']]

    Employee_ID          Name Department  Attendance_Rate
444     EMP1444  Employee_444      Sales            60.01

In [80]:
#12. What’s the salary range in each department?
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [81]:
salary_range=data.groupby('Department')['Salary'].agg(['min', 'max'])
print(salary_range)

              min     max
Department
Finance     30077  149235
HR          34425  148721
IT          30922  149797
Marketing   30814  143453
R&D         30060  149719
Sales       31279  149771

In [ ]:
#13. Add a column called "Experience_Years" based on Joining_Date.
data.columns

Index(['Employee_ID', 'Name', 'Department', 'Position', 'Salary',
       'Joining_Date', 'Performance_Rating', 'Leaves_Taken', 'Attendance_Rate',
       'Age'],
      dtype='object')

In [87]:
data['Experience_Years'] = (pd.Timestamp.today() - pd.to_datetime(data['Joining_Date'])).dt.days // 365
data[['Employee_ID', 'Experience_Years']]

    Employee_ID  Experience_Years
0       EMP1000                 6
1       EMP1001                 2
2       EMP1002                 2
3       EMP1003                 3
4       EMP1004                 0
..          ...               ...
495     EMP1495                 2
496     EMP1496                 3
497     EMP1497                 2
498     EMP1498                 5
499     EMP1499                 4

[500 rows x 2 columns]

In [91]:
#14. Filter all employees with "Good" or "Excellent" performance and salary > 100000.
filter=data[((data['Performance_Rating'] == 'Good') | (data['Performance_Rating'] == 'Excellent')) & (data['Salary'] > 100000)]
filter

,Employee_ID,Name,Department,Position,Salary,Joining_Date,Performance_Rating,Leaves_Taken,Attendance_Rate,Age,Experience_Years
4,EMP1004,Employee_4,Marketing,Team Lead,117388,2024-08-18,Good,15,78.85,44,0
15,EMP1015,Employee_15,Sales,Intern,135881,2019-12-12,Excellent,16,93.48,42,5
19,EMP1019,Employee_19,Sales,Executive,112985,2019-01-26,Excellent,1,80.51,42,6
23,EMP1023,Employee_23,Finance,Executive,105046,2022-03-02,Excellent,10,72.16,31,3
25,EMP1025,Employee_25,Marketing,Manager,123709,2019-12-28,Good,18,97.53,58,5
...,...,...,...,...,...,...,...,...,...,...,...
469,EMP1469,Employee_469,R&D,Executive,104666,2024-05-29,Good,1,75.51,43,1
478,EMP1478,Employee_478,IT,Analyst,116123,2024-03-28,Good,2,98.03,41,1
483,EMP1483,Employee_483,R&D,Manager,118929,2018-01-28,Excellent,15,85.77,43,7
487,EMP1487,Employee_487,Sales,Manager,144618,2023-08-09,Good,25,80.02,48,1
494,EMP1494,Employee_494,Marketing,Manager,124006,2018-09-27,Excellent,8,90.70,23,6

In [93]:
#15. Find the median salary for each position.
median_salary=data.groupby('Position')['Salary'].median()
median_salary

Position
Analyst      84771.0
Executive    89052.0
Intern       83302.0
Manager      87545.0
Team Lead    90076.5
Name: Salary, dtype: float64

In [94]:
#16. Create a pivot table showing average salary by Department and Position.
pivot_table=data.pivot_table(values='Salary', index='Department', columns='Position', aggfunc='mean')
pivot_table

Position,Analyst,Executive,Intern,Manager,Team Lead
Department,,,,,
Finance,85327.500000,97744.200000,89029.062500,100239.307692,100313.529412
HR,92469.666667,80344.375000,83446.695652,98367.526316,88501.181818
IT,81632.750000,94170.210526,82366.000000,84095.285714,90658.700000
Marketing,88256.625000,66981.272727,72602.076923,90343.235294,82413.277778
R&D,77091.000000,89672.375000,93649.142857,84829.368421,93351.052632
Sales,74246.400000,98177.625000,88428.692308,90111.782609,89425.727273

In [95]:
#17. What percentage of employees are in each performance rating category?
percentage=data['Performance_Rating'].value_counts(normalize=True) * 100
percentage

Performance_Rating
Good         40.6
Average      29.8
Excellent    21.0
Poor          8.6
Name: proportion, dtype: float64

In [96]:
#18. List employees with above average salary and below average attendance.
employes_average=data[(data['Salary'] > data['Salary'].mean()) & (data['Attendance_Rate'] < data['Attendance_Rate'].mean())]
employes_average

,Employee_ID,Name,Department,Position,Salary,Joining_Date,Performance_Rating,Leaves_Taken,Attendance_Rate,Age,Experience_Years
4,EMP1004,Employee_4,Marketing,Team Lead,117388,2024-08-18,Good,15,78.85,44,0
7,EMP1007,Employee_7,IT,Intern,88596,2024-11-18,Good,19,65.05,45,0
9,EMP1009,Employee_9,Marketing,Analyst,118861,2021-07-15,Average,21,73.00,28,4
20,EMP1020,Employee_20,Marketing,Intern,114056,2018-12-01,Average,20,72.21,56,6
22,EMP1022,Employee_22,Sales,Analyst,89207,2018-05-17,Excellent,19,61.33,31,7
...,...,...,...,...,...,...,...,...,...,...,...
469,EMP1469,Employee_469,R&D,Executive,104666,2024-05-29,Good,1,75.51,43,1
472,EMP1472,Employee_472,Marketing,Analyst,140616,2022-03-06,Average,11,60.17,50,3
480,EMP1480,Employee_480,Finance,Manager,105186,2018-05-10,Average,27,71.92,23,7
481,EMP1481,Employee_481,IT,Team Lead,115469,2020-04-17,Average,29,64.21,51,5
488,EMP1488,Employee_488,Marketing,Team Lead,99626,2022-01-12,Excellent,29,77.31,31,3